#-------------------------------------------------------------------------------
#-- NOTE: THIS FILE SHALL NOT BE MODIFIED.
#-------------------------------------------------------------------------------


################################################################################
# Primary Clocks
################################################################################
create_clock -period 4.000 -name cxph_gth_clk [get_ports cxph_gth_clk_p]


################################################################################
# Inter-Clock Constraints
################################################################################
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iClockNetwork/inst/mmcme3_adv_inst/CLKOUT0]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iClockNetwork/inst/mmcme3_adv_inst/CLKOUT1]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iClockNetwork/inst/mmcme3_adv_inst/CLKOUT2]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iCxphGth/iGthCxpLow/inst/gen_gtwizard_gthe3_top.gth_cxp_low_cxp12_gtwizard_gthe3_inst/gen_gtwizard_gthe3.gen_channel_container[2].gen_enabled_channel.gthe3_channel_wrapper_inst/channel_inst/gthe3_channel_gen.gen_gthe3_channel_inst[0].GTHE3_CHANNEL_PRIM_INST/RXOUTCLK]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iCxphGth/iGthCxpLow/inst/gen_gtwizard_gthe3_top.gth_cxp_low_cxp12_gtwizard_gthe3_inst/gen_gtwizard_gthe3.gen_channel_container[2].gen_enabled_channel.gthe3_channel_wrapper_inst/channel_inst/gthe3_channel_gen.gen_gthe3_channel_inst[1].GTHE3_CHANNEL_PRIM_INST/RXOUTCLK]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iCxphGth/iGthCxpLow/inst/gen_gtwizard_gthe3_top.gth_cxp_low_cxp12_gtwizard_gthe3_inst/gen_gtwizard_gthe3.gen_channel_container[2].gen_enabled_channel.gthe3_channel_wrapper_inst/channel_inst/gthe3_channel_gen.gen_gthe3_channel_inst[2].GTHE3_CHANNEL_PRIM_INST/RXOUTCLK]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iCxphGth/iGthCxpLow/inst/gen_gtwizard_gthe3_top.gth_cxp_low_cxp12_gtwizard_gthe3_inst/gen_gtwizard_gthe3.gen_channel_container[2].gen_enabled_channel.gthe3_channel_wrapper_inst/channel_inst/gthe3_channel_gen.gen_gthe3_channel_inst[3].GTHE3_CHANNEL_PRIM_INST/RXOUTCLK]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins */iMemInterface/iMemoryInterface/inst/u_ddr4_infrastructure/gen_mmcme3.u_mmcme_adv_inst/CLKOUT0]]


################################################################################
# I/O Constraints
################################################################################
# Multicycle path for Input I/Os
set_multicycle_path 5 -setup -from [get_ports io_ext1[3]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[3]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[4]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[4]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[5]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[5]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[6]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[6]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[7]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[7]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[8]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[8]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[9]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[9]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[10]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[10]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[11]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[11]]
set_multicycle_path 5 -setup -from [get_ports io_ext1[12]]
set_multicycle_path 4 -hold -end -from [get_ports io_ext1[12]]
# Multicycle path for Output I/Os
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[3]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[3]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[4]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[4]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[5]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[5]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[6]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[6]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[7]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[7]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[8]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[8]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[9]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[9]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[10]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[10]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[11]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[11]]
set_multicycle_path 5 -setup -start -to [get_ports io_ext1[12]]
set_multicycle_path 4 -hold -to [get_ports io_ext1[12]]
# Input delays
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[3]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[4]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[5]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[6]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[7]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[8]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[9]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[10]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[11]]
set_input_delay -clock extio_clk -max 8.000 [get_ports io_ext1[12]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[3]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[4]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[5]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[6]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[7]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[8]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[9]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[10]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[11]]
set_input_delay -clock extio_clk -min 2.000 [get_ports io_ext1[12]]
# Output delays
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[2]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[3]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[4]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[5]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[6]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[7]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[8]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[9]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[10]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[11]]
set_output_delay -clock extio_clk -max 7.000 [get_ports io_ext1[12]]
set_output_delay -clock extio_clk -max 0.000 [get_ports io_ext1[2]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[3]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[4]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[5]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[6]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[7]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[8]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[9]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[10]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[11]]
set_output_delay -clock extio_clk -min 0.000 [get_ports io_ext1[12]]
# False paths
set_false_path -from [get_ports {io_ext1[9]}] -to [get_ports {io_ext1[9]}]
set_false_path -from [get_ports {io_ext1[10]}] -to [get_ports {io_ext1[10]}]

set_false_path -from [get_ports {io_ext1[1]}]

set_false_path -to [get_ports {io_ext1[2]}] -through [get_pins {io_ext1_IOBUF[4]_inst/T}]
set_false_path -from [get_ports {io_ext1[2]}] -through [get_pins {io_ext1_IOBUF[4]_inst/T}]
set_false_path -to [get_ports {io_ext1[3]}] -through [get_pins {io_ext1_IOBUF[3]_inst/T}]
set_false_path -from [get_ports {io_ext1[3]}] -through [get_pins {io_ext1_IOBUF[3]_inst/T}]
set_false_path -to [get_ports {io_ext1[4]}] -through [get_pins {io_ext1_IOBUF[4]_inst/T}]
set_false_path -from [get_ports {io_ext1[4]}] -through [get_pins {io_ext1_IOBUF[4]_inst/T}]
set_false_path -to [get_ports {io_ext1[5]}] -through [get_pins {io_ext1_IOBUF[5]_inst/T}]
set_false_path -from [get_ports {io_ext1[5]}] -through [get_pins {io_ext1_IOBUF[5]_inst/T}]
set_false_path -to [get_ports {io_ext1[6]}] -through [get_pins {io_ext1_IOBUF[6]_inst/T}]
set_false_path -from [get_ports {io_ext1[6]}] -through [get_pins {io_ext1_IOBUF[6]_inst/T}]
set_false_path -to [get_ports {io_ext1[7]}] -through [get_pins {io_ext1_IOBUF[7]_inst/T}]
set_false_path -from [get_ports {io_ext1[7]}] -through [get_pins {io_ext1_IOBUF[7]_inst/T}]
set_false_path -to [get_ports {io_ext1[8]}] -through [get_pins {io_ext1_IOBUF[8]_inst/T}]
set_false_path -from [get_ports {io_ext1[8]}] -through [get_pins {io_ext1_IOBUF[8]_inst/T}]
set_false_path -to [get_ports {io_ext1[9]}] -through [get_pins {io_ext1_IOBUF[9]_inst/T}]
set_false_path -from [get_ports {io_ext1[9]}] -through [get_pins {io_ext1_IOBUF[9]_inst/T}]
set_false_path -to [get_ports {io_ext1[10]}] -through [get_pins {io_ext1_IOBUF[10]_inst/T}]
set_false_path -from [get_ports {io_ext1[10]}] -through [get_pins {io_ext1_IOBUF[10]_inst/T}]
set_false_path -to [get_ports {io_ext1[11]}] -through [get_pins {io_ext1_IOBUF[11]_inst/T}]
set_false_path -from [get_ports {io_ext1[11]}] -through [get_pins {io_ext1_IOBUF[11]_inst/T}]
set_false_path -to [get_ports {io_ext1[12]}] -through [get_pins {io_ext1_IOBUF[12]_inst/T}]
set_false_path -from [get_ports {io_ext1[12]}] -through [get_pins {io_ext1_IOBUF[12]_inst/T}]